[
  {
    "id": "2025-08-28T15:42:20.627Z-metje5",
    "title": "Eli Lilly's obesity pill remains a viable rival to Novo's oral Wegovy despite data that underwhelmed investors",
    "date": "2025-08-28T15:42:20.627Z",
    "sourceUrl": "https://www.cnbc.com/2025/08/24/eli-lilly-oral-obesity-pill-novo-nordisk.html",
    "sourceHost": "cnbc.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-fe63fz.md",
    "summary": "Eli Lilly's stock is still recovering after the drugmaker released trial data earlier this month on its closely watched obesity pill that underwhelmed Wall Street. In a key late-stage trial, Eli Lilly's pill, orforglipron, caused less weight loss and had higher side effects than what analysts were expecting. The pill's efficacy also appeared to come in slightly below that of Novo Nordisk's oral semaglutide for obesity, which showed strong data in a separate study."
  },
  {
    "id": "2025-08-28T15:42:18.116Z-rvnvpc",
    "title": "Bard PowerPort Lawsuit Bellwether Trials Set To Begin March 2, 2026",
    "date": "2025-08-28T15:42:18.116Z",
    "sourceUrl": "https://www.aboutlawsuits.com/bard-powerport-lawsuit/bard-powerport-lawsuit-bellwether-trials-march-2-2026/",
    "sourceHost": "aboutlawsuits.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-bzs3x2.md",
    "summary": "Eligible for a Bard PowerPort lawsuit?\nAbout Lawsuits\nSuboxone Tooth Decay\nDepo-Provera\nOzempic Wegovy and Mounjaro\nBard PowerPort\nJury trials will continue throughout next year, to help parties negotiate a potential Bard PowerPort lawsuit settlement that may resolve similar claims. Add Your Comments\nThe U.S. District Judge presiding over hundreds of Bard PowerPort lawsuits brought throughout the federal court system has set trial dates for several “bellwether” trials to begin early next year, putting claims that the port catheter implants were defectively designed before actual juries for the first time."
  },
  {
    "id": "2025-08-28T15:42:16.822Z-j5awqz",
    "title": "Vet explains how to manage your pet's weight amid 'doggy Mounjaro' plans",
    "date": "2025-08-28T15:42:16.822Z",
    "sourceUrl": "https://www.dailyrecord.co.uk/lifestyle/vet-explains-how-manage-your-35802378",
    "sourceHost": "dailyrecord.co.uk",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-07jhs0.md",
    "summary": "The UK has a worrying problem with podgy pets. Half of dogs in Britain and 43 per cent of cats are classified as overweight. But while Mounjaro for people rolled out on the NHS earlier this year, we could be seeing similar weight loss meds for our furry friends soon."
  },
  {
    "id": "2025-08-28T15:42:13.734Z-eo8iv0",
    "title": "Patients struggle to get weight loss drug ahead of price rise",
    "date": "2025-08-28T15:42:13.734Z",
    "sourceUrl": "https://www.bbc.com/news/articles/clyr8ynx41yo",
    "sourceHost": "bbc.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-o8d9ag.md",
    "summary": "Some patients taking the weight-loss drug Mounjaro have told BBC News they are struggling to obtain the medicine, and are worried about the impact on their health. There is rising demand for the drug, after the US manufacturer Eli Lilly announced a major price increase from 1 September. The drug giant has warned against \"inappropriate stockpiling of medicines\" and has now asked UK distributors to stop taking orders from pharmacies from the end of today."
  },
  {
    "id": "2025-08-28T15:42:12.476Z-chapg6",
    "title": "Serena Williams lost 14kg—here’s what GLP-1 injections really do and the 5 risks to watch out for",
    "date": "2025-08-28T15:42:12.476Z",
    "sourceUrl": "https://gulfnews.com/lifestyle/health-fitness/inside-serena-williams-14kg-weight-loss-how-glp-1-injections-work-and-5-side-effects-to-know-1.500244395",
    "sourceHost": "gulfnews.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-bxxibg.md",
    "summary": "These injections aren't completely without risks\nRecently, tennis legend Serena Williams opened up about using weight-loss medication, aiming to break the ‘stigma’ around such treatments. The 43-year-old, who has won 23 Grand Slam titles and is the epitome of athleticism, admits that after having children, she struggled to shed the extra pounds—just like many of us. Speaking to the Today Show in the US, Williams described her extra weight as “an opponent.” Despite training five hours a day—running, biking, walking, and climbing stairs—she couldn’t defeat it the way she did on the tennis court."
  },
  {
    "id": "2025-08-28T15:42:09.866Z-g04iwq",
    "title": "GLP-1 drugs dominate prescription TV ad spend",
    "date": "2025-08-28T15:42:09.866Z",
    "sourceUrl": "https://www.emarketer.com/content/glp-1-drugs-dominate-prescription-tv-ad-spend",
    "sourceHost": "emarketer.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-9o74wm.md",
    "summary": "Boost your brand and generate demand with media programs. Read through guides, explore resource hubs, and sample our coverage. Register for an upcoming webinar and track which industry events our analysts attend."
  },
  {
    "id": "2025-08-28T15:42:09.062Z-x7e5l7",
    "title": "Serena Williams lost 14 kg using GLP-1 drug: 8 things to know about the weight loss medication",
    "date": "2025-08-28T15:42:09.062Z",
    "sourceUrl": "https://www.hindustantimes.com/lifestyle/health/serena-williams-lost-14-kg-using-glp-1-drug-8-things-to-know-about-the-weight-loss-medication-101756046354195.html",
    "sourceHost": "hindustantimes.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-0m46fu.md",
    "summary": "Subscribe Now! Get features like\nTennis champion Serena Williams has caused a stir after revealing that using GLP-1 medication has been key to her weight-loss journey. After two pregnancies, she found it hard to return to a healthy weight despite rigorous diet and training. The 43-year-old, who has reduced 31 lbs, is one of the many global celebrities, including the likes of Sharon Osbourne, Rebel Wilson and Lizzo."
  },
  {
    "id": "2025-08-28T15:42:08.156Z-u6rbii",
    "title": "Ozempic teeth: Dentists warn of new GLP-1 side effect",
    "date": "2025-08-28T15:42:08.156Z",
    "sourceUrl": "https://ca.news.yahoo.com/ozempic-teeth-dentists-warn-glp-184445013.html",
    "sourceHost": "ca.news.yahoo.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-d4pw56.md",
    "summary": "Manage your account\nRelated video: So, you’ve lost weight using Wegovy. Does that mean you can stop taking it? (AP)\nPatients using Ozempic and other GLP-1 drugs are reporting a complication not listed among the drug’s most common side effects. We’re not talking about “Ozempic babies,” but that’s also a thing."
  },
  {
    "id": "2025-08-28T15:42:07.093Z-d48wkd",
    "title": "The controversy around Serena Williams' weight loss is more nuanced than you may think",
    "date": "2025-08-28T15:42:07.093Z",
    "sourceUrl": "https://www.npr.org/2025/08/25/nx-s1-5511375/the-controversy-around-serena-williams-weight-loss-is-more-nuanced-than-you-may-think",
    "sourceHost": "npr.org",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-s95qwt.md",
    "summary": "By\nLinah Mohammad\n,\nJuana Summers\n,\nJeanette Woods\nThe tennis legend is back in the news - but not for her prowess on the court. Why the controversy around her weight loss is more nuanced than you think. JUANA SUMMERS, HOST:\nTennis legend Serena Williams is making headlines again, but this time, it's not about her dominance on the court."
  },
  {
    "id": "2025-08-28T15:42:06.165Z-swdclk",
    "title": "Eli Lilly could bring first widely available GLP‑1 pill for obesity, diabetes to market this year",
    "date": "2025-08-28T15:42:06.165Z",
    "sourceUrl": "https://www.scrippsnews.com/health/medicine/eli-lilly-could-bring-first-widely-available-glp-1-pill-for-obesity-diabetes-to-market-this-year",
    "sourceHost": "scrippsnews.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-ilr1op.md",
    "summary": "Eli Lilly, in the race to develop the first major oral GLP‑1 drug for weight loss, says its pill orforglipron will be submitted for approval this year after a Phase 3 study found it delivered double-digit weight loss in people with Type 2 diabetes. The announcement comes as Eli Lilly concludes a Phase 3 study that found orforglipron delivered \"significant weight loss, meaningful A1C reductions, and improvements in cardiometabolic risk factors\" after 72 weeks. Eli Lilly says trial participants who took the highest dose of orforglipron lost an average of 10.5% of their body weight after 72 weeks."
  },
  {
    "id": "2025-08-28T15:42:04.748Z-0b9t2n",
    "title": "Lilly readies its first weight loss drug pill for approval",
    "date": "2025-08-28T15:42:04.748Z",
    "sourceUrl": "https://www.emarketer.com/content/eli-lilly-moves-file-approval-of-glp-1-weight-loss-pill",
    "sourceHost": "emarketer.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-y92qzi.md",
    "summary": "Boost your brand and generate demand with media programs. Read through guides, explore resource hubs, and sample our coverage. Register for an upcoming webinar and track which industry events our analysts attend."
  },
  {
    "id": "2025-08-28T15:42:03.593Z-1jhwcp",
    "title": "GLP-1 Indications Continue to Expand: Potential approvals expected through 2026 | Lockton",
    "date": "2025-08-28T15:42:03.593Z",
    "sourceUrl": "https://global.lockton.com/us/en/news-insights/glp-1-indications-continue-to-expand-potential-approvals",
    "sourceHost": "global.lockton.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-5pyyyp.md",
    "summary": "ARTICLES / AUGUST 26, 2025\nFollowing other expanded indications (opens a new window) for GLP-1s, Wegovy has now received FDA approval for the treatment of metabolic dysfunction-associated steatohepatitis (MASH) in adults with moderate-to-advanced fibrosis. This marks a significant expansion in the therapeutic landscape for GLP-1s, highlighting their growing role in addressing complex metabolic conditions. The growing GLP-1 approval pipeline has significant implications for employers in terms of cost, coverage, and employee access."
  },
  {
    "id": "2025-08-28T15:42:02.057Z-1h0h5i",
    "title": "Eli Lilly GLP-1 pill shows promising weight loss in type 2 diabetes trial",
    "date": "2025-08-28T15:42:02.057Z",
    "sourceUrl": "https://www.usatoday.com/story/news/health/2025/08/26/lilly-glp-1-pill-weight-loss/85830686007/",
    "sourceHost": "usatoday.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-bhq0u0.md",
    "summary": "Eli Lilly LLY.N said on Tuesday its experimental GLP-1 pill helped overweight adults with type 2 diabetes shed 10.5% of body weight in a late-stage trial, after recent data from another study of the drug in patients without diabetes sent company shares tumbling. Shares of the drugmaker rose 2.4% to $712 in premarket trading. The once-daily pill also helped 75% of patients who received the highest dose of orforglipron lower their A1C level - a measure of blood sugar over time - to at or below 6.5%, Lilly said, which is below the American Diabetes Association's target of less than 7% for most adults."
  },
  {
    "id": "2025-08-28T15:42:00.596Z-2wjklw",
    "title": "Eli Lilly’s weight loss pill orforglipron clears its latest trial, paving way for approval",
    "date": "2025-08-28T15:42:00.596Z",
    "sourceUrl": "https://www.cnbc.com/2025/08/26/eli-lilly-weight-loss-pill-orforglipron-clears-trial-paving-way-for-approval.html",
    "sourceHost": "cnbc.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-6pikg3.md",
    "summary": "In this article\nEli Lilly on Tuesday said its daily weight loss pill helped patients with obesity and Type 2 diabetes shed weight in a late-stage trial, meeting the study's main goal and clearing the way for the company to file for approval of the drug globally. The treatment is inching closer to becoming a new, needle-free alternative in the highly lucrative market for weight loss and diabetes drugs called GLP-1s. More convenient pills could boost supply for the treatments and make them easier to access than the pricey weekly injections currently dominating the space."
  },
  {
    "id": "2025-08-28T15:41:59.626Z-st4wh0",
    "title": "Lilly rounds out oral GLP-1 approval bid with phase 3 obesity win for patients with diabetes",
    "date": "2025-08-28T15:41:59.626Z",
    "sourceUrl": "https://www.fiercebiotech.com/biotech/lilly-rounds-out-oral-glp-1-approval-bid-ph-3-win-patients-obesity-and-diabetes",
    "sourceHost": "fiercebiotech.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-ynto0z.md",
    "summary": "After Eli Lilly’s phase 3 data drop for its oral GLP-1 asset orforglipron earlier this month, the Indianapolis drugmaker has unveiled the second half of the data package that will support the med’s chances of securing a green light in obesity. Tuesday, Lilly reported that all three doses of orforglipron helped its late-stage Attain-2 trial meet its primary endpoint and all key secondary endpoints. The drug helped patients achieve up to an average of 23 pounds in weight loss as well as a reduction in average blood sugar levels and cardiometabolic risk factors by the trial’s 72-week mark."
  }
]