[
  {
    "id": "2025-08-29T08:18:52.343Z-1diz22",
    "title": "Reimbursement for NHS Mounjaro dispensing confirmed for September 2025",
    "date": "2025-08-29T08:18:52.343Z",
    "sourceUrl": "https://pharmaceutical-journal.com/article/news/reimbursement-for-nhs-mounjaro-dispensing-confirmed-for-september-2025",
    "sourceHost": "pharmaceutical-journal.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-29-dml3o9.md",
    "summary": "This site is intended for healthcare professionals\nBy Saša Janković\nShutterstock.com\nNHS prescriptions for Mounjaro (tirzepatide; Eli Lilly) will be reimbursed at the new higher list prices, following an agreement between Community Pharmacy England (CPE) and the Department of Health and Social Care (DHSC). The agreement, announced on 27 August 2025, covers branded and generically written NHS prescriptions for all strengths of Mounjaro dispensed from 1 September 2025, which ensures that pharmacy owners will not be dispensing at a loss. This follows Lilly’s decision to increase UK list prices for the weight-loss medicine from 1 September 2025 to address “pricing inconsistencies” compared to other developed countries, including in Europe."
  },
  {
    "id": "2025-08-29T08:18:49.853Z-5g8mvb",
    "title": "Should You Microdose GLP-1 Drugs?",
    "date": "2025-08-29T08:18:49.853Z",
    "sourceUrl": "https://health.clevelandclinic.org/microdosing-glp-1",
    "sourceHost": "health.clevelandclinic.org",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-29-mgagqf.md",
    "summary": "Taking a smaller dose than what your doctor recommends isn’t a good idea\nIf you take a GLP-1 agonist for weight loss or diabetes, there’s a good chance you may have heard about “microdosing” the medication. Advertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission."
  },
  {
    "id": "2025-08-29T08:18:48.553Z-myaxy9",
    "title": "The Pharma Exec Behind Mounjaro Lists His 117-Acre Wyoming Ranch for $40 Million",
    "date": "2025-08-29T08:18:48.553Z",
    "sourceUrl": "https://robbreport.com/shelter/celebrity-homes/jan-lundberg-117-acre-ranch-wyoming-jackson-hole-1237003421/",
    "sourceHost": "robbreport.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-29-2zzkc1.md",
    "summary": "By providing your information, you agree to our Terms of Use and our Privacy Policy. We use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply."
  },
  {
    "id": "2025-08-29T08:18:47.622Z-6nh84m",
    "title": "Eli Lilly Faces Criticism Over Mounjaro Price Increase Plans - Investors Hangout",
    "date": "2025-08-29T08:18:47.622Z",
    "sourceUrl": "https://investorshangout.com/eli-lilly-faces-criticism-over-mounjaro-price-increase-plans-375784-/",
    "sourceHost": "investorshangout.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-29-cbacxk.md",
    "summary": "Patients in the UK are encountering significant difficulties in acquiring Mounjaro, a medication known for weight management and diabetes control, as demand escalates ahead of an imminent price hike. Eli Lilly and Co, the American company behind this medication, has announced a staggering increase in Mounjaro's price, raising it by as much as 170%. This price surge will affect the highest dosage, with costs escalating from £122 to £330 monthly."
  },
  {
    "id": "2025-08-29T08:18:45.559Z-3k95j0",
    "title": "I'm a weight-loss doctor - how to survive the Mounjaro price hike",
    "date": "2025-08-29T08:18:45.559Z",
    "sourceUrl": "https://www.dailymail.co.uk/health/article-15010253/weight-loss-doctor-Mounjaro-price-hike-david-strain.html",
    "sourceHost": "dailymail.co.uk",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-29-lonc2f.md",
    "summary": "By PROFESSOR DAVID STRAIN, ASSOCIATE PROFESSOR OF CARDIOMETABOLIC HEALTH\nPublished: 10:04 EDT, 28 August 2025 | Updated: 12:39 EDT, 28 August 2025\n145\nView comments\nNews that weight-loss jab Mounjaro has become the latest casualty of global politics would have come as a disappointment to patients across the UK. Eli Lilly, its US-based manufacturer, recently confirmed that the price of the drug will rise steeply for British patients from September 1 as a result of a White House push to raise drug prices in Europe so they can be lowered in the US. As a doctor, I know this will be worrying for the estimated 1.5million people who buy the injection privately in the UK."
  },
  {
    "id": "2025-08-29T08:18:43.570Z-rubcgq",
    "title": "Do you lose more weight on the higher doses of Mounjaro?",
    "date": "2025-08-29T08:18:43.570Z",
    "sourceUrl": "https://www.secondnature.io/guides/weight-loss-medications/higher-doses-of-mounjaro",
    "sourceHost": "secondnature.io",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-29-iizz1t.md",
    "summary": "US\nHow It Works\nSuccess Stories\nGuides\nOur Story\nNHS\nVitality\nCheck my eligibility\nCheck my eligibility\nLog in\nUS\nRobbie Puddick (RNutr)\nContent and SEO Lead\nDr Rachel Hall (MBCHB)\nPrincipal Doctor\nJump to: Evidence from clinical trials | Dose-response relationship | Individual factors affecting results | Side effects at different doses | How to find your ideal Mounjaro dose | Frequently asked questions | Take home message\nThe higher doses of Mounjaro (tirzepatide) typically lead to greater weight loss, with clinical trials showing approximately 6-7% additional weight loss when increasing from 5 mg to 15 mg. Most people will lose more weight as they progress to higher doses, but the relationship isn’t perfectly linear; the jump from 2.5 mg to 5 mg often produces more significant increases in weight loss than the jump from 12.5 mg to 15 mg. Clinical trials show that while the 15 mg maintenance dose of Mounjaro produces the most substantial average weight loss (~22.5% over 72 weeks), many people achieve impressive results on middle doses, especially when combined with healthy eating habits and physical activity."
  },
  {
    "id": "2025-08-29T08:18:38.605Z-ipdpdk",
    "title": "Eli Lilly pauses shipments of weight loss drug Mounjaro to UK - NewsmovesmarketsForex.com",
    "date": "2025-08-29T08:18:38.605Z",
    "sourceUrl": "https://newsmovesmarketsforex.com/eli-lilly-pauses-shipments-of-weight-loss-drug-mounjaro-to-uk/",
    "sourceHost": "newsmovesmarketsforex.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-29-dzzyh6.md",
    "summary": "Select Page\nPosted by The Guardian | Health, Health policy, Obesity, Pharmaceuticals industry, Politics, Society, The Guardian, UK news | 0 |\nUS firm Eli Lilly reportedly tells British wholesalers to stop taking orders as demand soars before September price rise\nBusiness live – latest updates\nThe manufacturer of the weight loss drug Mounjaro has paused shipments to the UK ahead of a significant price rise for the treatment due to come into effect next month. The US pharmaceutical company Eli Lilly is due to increase the UK list price of the drug by up to 170% from September amid a White House push to get drugmakers to raise medicine prices in Europe to allow for price cuts in the US. Continue reading…\nShare:\nRate:\nAugust 20, 2025\nNovember 13, 2022\nNovember 14, 2022\nFebruary 6, 2023\nYour email address will not be published."
  },
  {
    "id": "2025-08-29T08:18:34.555Z-ik9wc8",
    "title": "Eli Lilly pauses UK Mounjaro orders ahead of price hike, citing stockpiling concerns",
    "date": "2025-08-29T08:18:34.555Z",
    "sourceUrl": "https://www.fiercepharma.com/pharma/eli-lilly-pauses-uk-mounjaro-orders-ahead-september-price-hike-citing-stockpiling-concerns",
    "sourceHost": "fiercepharma.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-29-6tm8ia.md",
    "summary": "Ahead of plans to raise the price of its Type 2 diabetes and obesity blockbuster in the United Kingdom next month, Eli Lilly is temporarily halting Mounjaro orders from the country. Lilly plans to resume taking requisitions for the dual GIP/GLP-1 agonist in the U.K. on Sept."
  },
  {
    "id": "2025-08-29T08:18:33.400Z-6rpmy7",
    "title": "Teva's Breakthrough in the GLP-1 Market with Generic Saxenda: A Game-Changer for Obesity Treatment and Long-Term Growth",
    "date": "2025-08-29T08:18:33.400Z",
    "sourceUrl": "https://www.ainvest.com/news/teva-breakthrough-glp-1-market-generic-saxenda-game-changer-obesity-treatment-long-term-growth-2508/",
    "sourceHost": "ainvest.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-29-eof972.md",
    "summary": "News/\nHealth Care/\nTEVA/\nArticles Details\nAs an AI-powered financial analyst, I bring data-driven energy and a unique algorithmic perspective to breaking down market moves, helping readers make sense of the financial world with clarity and insight. - Teva Pharmaceuticals is launching a generic Saxenda (GLP-1 RA) to capitalize on the $50B obesity treatment market, projected to grow at 18.54% CAGR through 2030. - Leveraging its first-to-market advantage and 30% lower pricing strategy (as seen with generic Victoza), Teva aims to undercut branded drugs like Wegovy and Zepbound."
  },
  {
    "id": "2025-08-29T08:18:32.253Z-tr2y47",
    "title": "What’s the difference between the GLP-1s on the market?",
    "date": "2025-08-29T08:18:32.253Z",
    "sourceUrl": "https://www.healthcare-brew.com/stories/2025/08/28/the-difference-between-glp-1s-on-the-market",
    "sourceHost": "healthcare-brew.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-29-bauz0d.md",
    "summary": "From semaglutide vs. tirzepatide to Ozempic vs. Wegovy."
  },
  {
    "id": "2025-08-29T08:18:31.154Z-xd3kgw",
    "title": "New GLP-1 Pill Helps People Lose 23 Pounds in Study",
    "date": "2025-08-29T08:18:31.154Z",
    "sourceUrl": "https://www.nbcrightnow.com/lifestyles/health/new-glp-1-pill-helps-people-lose-23-pounds-in-study/article_fac4f730-56bf-51d9-9ddd-577fa2d80d01.html",
    "sourceHost": "nbcrightnow.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-29-sdt2lv.md",
    "summary": "A clear sky. Low 62F. Winds light and variable.."
  },
  {
    "id": "2025-08-29T08:18:14.064Z-u74x21",
    "title": "One in Seven Adults Started a GLP-1 Agent After Bariatric Surgery",
    "date": "2025-08-29T08:18:14.064Z",
    "sourceUrl": "https://www.medpagetoday.com/endocrinology/obesity/117186",
    "sourceHost": "medpagetoday.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-29-3zza5x.md",
    "summary": "More and more patients who undergo bariatric surgery are starting a GLP-1 receptor agonist, according to a retrospective cohort study. Among over 112,000 patients, 14% started a GLP-1 agent after undergoing bariatric surgery, reported Hemalkumar B. Mehta, PhD, of Johns Hopkins Bloomberg School of Public Health in Baltimore, and colleagues."
  },
  {
    "id": "2025-08-29T08:18:12.836Z-03k6h9",
    "title": "GLP-1 receptor agonists improve heart failure outcomes and reduce environmental impact",
    "date": "2025-08-29T08:18:12.836Z",
    "sourceUrl": "https://www.news-medical.net/news/20250827/GLP-1-receptor-agonists-improve-heart-failure-outcomes-and-reduce-environmental-impact.aspx",
    "sourceHost": "news-medical.net",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-29-lpjjqx.md",
    "summary": "New research has found that the use of GLP-1 receptor agonists, a class of medications commonly prescribed for patients with obesity and diabetes, reduces the environmental footprint of healthcare and clinical outcomes when used to treat heart failure. Treatment of heart failure patients with these therapies led to fewer hospitalizations and lower calorie intake, which together translated into decreased greenhouse gas emissions, less medical waste, and reduced water usage. The study is one of the first to quantify the environmental co-benefits of pharmacologic treatment."
  },
  {
    "id": "2025-08-29T08:17:56.370Z-rpmzdd",
    "title": "Increasing numbers of bariatric surgery patients turn to GLP-1 drugs",
    "date": "2025-08-29T08:17:56.370Z",
    "sourceUrl": "https://www.news-medical.net/news/20250827/Increasing-numbers-of-bariatric-surgery-patients-turn-to-GLP-1-drugs.aspx",
    "sourceHost": "news-medical.net",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-29-we4lp8.md",
    "summary": "Bariatric surgery is usually effective on its own for weight loss, but an increasing proportion of patients who undergo bariatric surgery start taking one of the new glucagon-like 1 peptide receptor agonist (GLP-1) weight-loss drugs in the years after their surgery, according to a new study led by researchers at the Johns Hopkins Bloomberg School of Public Health. The researchers analyzed de-identified national electronic health records covering 112,858 individuals who underwent bariatric surgery from January 2015 to May 2023. They found that 14% of those patients used a GLP-1 such as semaglutide (Wegovy) or tirzepatide (Zepbound) during a follow-up period of up to 10 years after surgery."
  },
  {
    "id": "2025-08-28T15:42:20.627Z-metje5",
    "title": "Eli Lilly's obesity pill remains a viable rival to Novo's oral Wegovy despite data that underwhelmed investors",
    "date": "2025-08-28T15:42:20.627Z",
    "sourceUrl": "https://www.cnbc.com/2025/08/24/eli-lilly-oral-obesity-pill-novo-nordisk.html",
    "sourceHost": "cnbc.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-fe63fz.md",
    "summary": "Akcie Eli Lilly se stále zotavují poté, co farmaceutická společnost začátkem tohoto měsíce zveřejnila údaje z klinické studie o svém pečlivě sledovaném léku na obezitu, který však Wall Street zklamal. V klíčové fázi pozdní studie způsobila pilulka Eli Lilly, orforglipron, menší úbytek hmotnosti a měla více vedlejších účinků, než analytici očekávali. Účinnost pilulky se také zdála být mírně nižší než u orálního semaglutidu od Novo Nordisk pro obezitu, který v samostatné studii vykázal silné výsledky."
  },
  {
    "id": "2025-08-28T15:42:18.116Z-rvnvpc",
    "title": "Bard PowerPort Lawsuit Bellwether Trials Set To Begin March 2, 2026",
    "date": "2025-08-28T15:42:18.116Z",
    "sourceUrl": "https://www.aboutlawsuits.com/bard-powerport-lawsuit/bard-powerport-lawsuit-bellwether-trials-march-2-2026/",
    "sourceHost": "aboutlawsuits.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-bzs3x2.md",
    "summary": "Oprávněni k žalobě na Bard PowerPort?  \nO žalobách  \nZubní kaz způsobený Suboxonem  \nDepo-Provera  \nOzempic, Wegovy a Mounjaro  \nBard PowerPort  \nSoudní procesy s porotou budou pokračovat i v příštím roce, aby pomohly stranám vyjednat možné urovnání žaloby na Bard PowerPort, které by mohlo vyřešit podobné nároky. Přidejte své komentáře.  \nFederální soudce, který dohlíží na stovky žalob na Bard PowerPort podaných v rámci federálního soudního systému, stanovil termíny několika „předběžných“ soudních procesů, které začnou začátkem příštího roku, čímž se poprvé před skutečné poroty dostanou nároky, že implantáty portových katétrů byly vadně navrženy."
  },
  {
    "id": "2025-08-28T15:42:16.822Z-j5awqz",
    "title": "Vet explains how to manage your pet's weight amid 'doggy Mounjaro' plans",
    "date": "2025-08-28T15:42:16.822Z",
    "sourceUrl": "https://www.dailyrecord.co.uk/lifestyle/vet-explains-how-manage-your-35802378",
    "sourceHost": "dailyrecord.co.uk",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-07jhs0.md",
    "summary": "Ve Velké Británii je znepokojující problém s baculatými mazlíčky. Polovina psů v Británii a 43 procent koček je klasifikována jako s nadváhou. Zatímco Mounjaro pro lidi bylo dříve letos zavedené v NHS, brzy bychom mohli vidět podobné léky na hubnutí i pro naše chlupaté přátele."
  },
  {
    "id": "2025-08-28T15:42:13.734Z-eo8iv0",
    "title": "Patients struggle to get weight loss drug ahead of price rise",
    "date": "2025-08-28T15:42:13.734Z",
    "sourceUrl": "https://www.bbc.com/news/articles/clyr8ynx41yo",
    "sourceHost": "bbc.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-o8d9ag.md",
    "summary": "Někteří pacienti užívající lék na hubnutí Mounjaro řekli BBC News, že mají potíže s jeho získáním a obávají se dopadu na své zdraví. Poptávka po léku roste poté, co americký výrobce Eli Lilly oznámil od 1. září výrazné zvýšení ceny. Tento farmaceutický gigant varoval před „nevhodným hromaděním léků“ a nyní požádal britské distributory, aby od konce dneška přestali přijímat objednávky od lékáren."
  },
  {
    "id": "2025-08-28T15:42:12.476Z-chapg6",
    "title": "Serena Williams lost 14kg—here’s what GLP-1 injections really do and the 5 risks to watch out for",
    "date": "2025-08-28T15:42:12.476Z",
    "sourceUrl": "https://gulfnews.com/lifestyle/health-fitness/inside-serena-williams-14kg-weight-loss-how-glp-1-injections-work-and-5-side-effects-to-know-1.500244395",
    "sourceHost": "gulfnews.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-bxxibg.md",
    "summary": "Tyto injekce nejsou zcela bez rizik. Nedávno tenisová legenda Serena Williams otevřeně promluvila o užívání léků na hubnutí, s cílem prolomit „stigma“ kolem těchto léčebných metod. Čtyřiačtyřicetiletá sportovkyně, která vyhrála 23 grandslamových titulů a je ztělesněním atletiky, přiznala, že po narození dětí měla problém shodit přebytečná kila – stejně jako mnoho z nás. V rozhovoru pro americkou show Today Show popsala svou nadváhu jako „soupeře“. Přestože trénovala pět hodin denně – běhala, jezdila na kole, chodila a šplhala po schodech – nedokázala ji porazit tak, jak to dokázala na tenisovém kurtu[1][2]."
  },
  {
    "id": "2025-08-28T15:42:09.866Z-g04iwq",
    "title": "GLP-1 drugs dominate prescription TV ad spend",
    "date": "2025-08-28T15:42:09.866Z",
    "sourceUrl": "https://www.emarketer.com/content/glp-1-drugs-dominate-prescription-tv-ad-spend",
    "sourceHost": "emarketer.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-9o74wm.md",
    "summary": "Posilte svou značku a generujte poptávku pomocí mediálních programů. Projděte si průvodce, prozkoumejte zdrojová centra a vyzkoušejte naše pokrytí. Zaregistrujte se na nadcházející webinář a sledujte, kterých průmyslových akcí se naši analytici účastní."
  },
  {
    "id": "2025-08-28T15:42:09.062Z-x7e5l7",
    "title": "Serena Williams lost 14 kg using GLP-1 drug: 8 things to know about the weight loss medication",
    "date": "2025-08-28T15:42:09.062Z",
    "sourceUrl": "https://www.hindustantimes.com/lifestyle/health/serena-williams-lost-14-kg-using-glp-1-drug-8-things-to-know-about-the-weight-loss-medication-101756046354195.html",
    "sourceHost": "hindustantimes.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-0m46fu.md",
    "summary": "Přihlaste se nyní! Získejte funkce jako  \nTenisová šampionka Serena Williams vyvolala rozruch poté, co odhalila, že užívání léku GLP-1 bylo klíčové pro její cestu za hubnutím. Po dvou těhotenstvích měla problém vrátit se k zdravé váze i přes přísnou dietu a trénink. Čtyřiačtyřicetiletá sportovkyně, která zhubla 14 kg, je jednou z mnoha světových celebrit, mezi které patří i Sharon Osbourne, Rebel Wilson a Lizzo."
  },
  {
    "id": "2025-08-28T15:42:08.156Z-u6rbii",
    "title": "Ozempic teeth: Dentists warn of new GLP-1 side effect",
    "date": "2025-08-28T15:42:08.156Z",
    "sourceUrl": "https://ca.news.yahoo.com/ozempic-teeth-dentists-warn-glp-184445013.html",
    "sourceHost": "ca.news.yahoo.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-d4pw56.md",
    "summary": "Spravujte svůj účet  \nSouvisející video: Takže jste zhubli pomocí Wegovy. Znamená to, že ji můžete přestat užívat? (AP)  \nPacienti užívající Ozempic a jiné léky GLP-1 hlásí komplikaci, která není uvedena mezi nejčastějšími vedlejšími účinky léku. Nemluvíme zde o „Ozempic miminkách“, ale to je také téma."
  },
  {
    "id": "2025-08-28T15:42:07.093Z-d48wkd",
    "title": "The controversy around Serena Williams' weight loss is more nuanced than you may think",
    "date": "2025-08-28T15:42:07.093Z",
    "sourceUrl": "https://www.npr.org/2025/08/25/nx-s1-5511375/the-controversy-around-serena-williams-weight-loss-is-more-nuanced-than-you-may-think",
    "sourceHost": "npr.org",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-s95qwt.md",
    "summary": "Autorky  \nLinah Mohammad, Juana Summers, Jeanette Woods  \nTenisová legenda je zpět v médiích – ale ne kvůli svým výkonům na kurtu. Proč je kontroverze kolem jejího hubnutí složitější, než si myslíte. JUANA SUMMERS, MODERÁTORKA:  \nTenisová legenda Serena Williams opět dělá hlavy, ale tentokrát to není o její dominanci na kurtu."
  },
  {
    "id": "2025-08-28T15:42:06.165Z-swdclk",
    "title": "Eli Lilly could bring first widely available GLP‑1 pill for obesity, diabetes to market this year",
    "date": "2025-08-28T15:42:06.165Z",
    "sourceUrl": "https://www.scrippsnews.com/health/medicine/eli-lilly-could-bring-first-widely-available-glp-1-pill-for-obesity-diabetes-to-market-this-year",
    "sourceHost": "scrippsnews.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-ilr1op.md",
    "summary": "Eli Lilly, v závodě o vývoj první významné perorální GLP-1 léku na hubnutí, uvádí, že jeho tableta orforglipron bude letos podána k schválení poté, co studie fáze 3 zjistila, že u lidí s diabetem 2. typu přinesla dvouciferný úbytek hmotnosti. Toto oznámení přichází poté, co Eli Lilly dokončila studii fáze 3, která zjistila, že orforglipron způsobil „významný úbytek hmotnosti, smysluplné snížení hodnoty A1C a zlepšení kardiometabolických rizikových faktorů“ po 72 týdnech. Eli Lilly uvádí, že účastníci studie, kteří užívali nejvyšší dávku orforglipronu, ztratili v průměru 10,5 % své tělesné hmotnosti po 72 týdnech[1][2]."
  },
  {
    "id": "2025-08-28T15:42:04.748Z-0b9t2n",
    "title": "Lilly readies its first weight loss drug pill for approval",
    "date": "2025-08-28T15:42:04.748Z",
    "sourceUrl": "https://www.emarketer.com/content/eli-lilly-moves-file-approval-of-glp-1-weight-loss-pill",
    "sourceHost": "emarketer.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-y92qzi.md",
    "summary": "Posilte svou značku a generujte poptávku pomocí mediálních programů. Projděte si návody, prozkoumejte zdrojová centra a vyzkoušejte naše pokrytí. Zaregistrujte se na nadcházející webinář a sledujte, kterých průmyslových akcí se naši analytici účastní."
  },
  {
    "id": "2025-08-28T15:42:03.593Z-1jhwcp",
    "title": "GLP-1 Indications Continue to Expand: Potential approvals expected through 2026 | Lockton",
    "date": "2025-08-28T15:42:03.593Z",
    "sourceUrl": "https://global.lockton.com/us/en/news-insights/glp-1-indications-continue-to-expand-potential-approvals",
    "sourceHost": "global.lockton.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-5pyyyp.md",
    "summary": "Články / 26. srpna 2025  \nPo dalších rozšířených indikacích pro GLP-1 získal Wegovy nyní schválení FDA pro léčbu metabolicky podmíněné steatohepatitidy (MASH) u dospělých s mírným až pokročilým fibrózním postižením jater. Toto představuje významné rozšíření terapeutických možností GLP-1, zdůrazňující jejich rostoucí roli v léčbě složitých metabolických onemocnění. Rostoucí schvalovací pipeline GLP-1 má významné dopady pro zaměstnavatele z hlediska nákladů, pojištění a přístupu zaměstnanců k léčbě."
  },
  {
    "id": "2025-08-28T15:42:02.057Z-1h0h5i",
    "title": "Eli Lilly GLP-1 pill shows promising weight loss in type 2 diabetes trial",
    "date": "2025-08-28T15:42:02.057Z",
    "sourceUrl": "https://www.usatoday.com/story/news/health/2025/08/26/lilly-glp-1-pill-weight-loss/85830686007/",
    "sourceHost": "usatoday.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-bhq0u0.md",
    "summary": "Společnost Eli Lilly LLY.N v úterý uvedla, že její experimentální pilulka GLP-1 pomohla dospělým s nadváhou a diabetem 2. typu zhubnout v pozdní fázi klinické studie o 10,5 % tělesné hmotnosti, poté co nedávná data z jiné studie léku u pacientů bez diabetu způsobila pokles akcií společnosti. Akcie farmaceutické firmy vzrostly o 2,4 % na 712 dolarů v předobchodním obchodování. Jednou denně užívaná pilulka také pomohla 75 % pacientů, kteří dostávali nejvyšší dávku orforglipronu, snížit hladinu A1C – ukazatele průměrné hladiny cukru v krvi za delší období – na hodnotu 6,5 % nebo nižší, což je pod cílovou hodnotou 7 % stanovenou Americkou diabetologickou asociací pro většinu dospělých, uvedla společnost Lilly[1][3]."
  },
  {
    "id": "2025-08-28T15:42:00.596Z-2wjklw",
    "title": "Eli Lilly’s weight loss pill orforglipron clears its latest trial, paving way for approval",
    "date": "2025-08-28T15:42:00.596Z",
    "sourceUrl": "https://www.cnbc.com/2025/08/26/eli-lilly-weight-loss-pill-orforglipron-clears-trial-paving-way-for-approval.html",
    "sourceHost": "cnbc.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-6pikg3.md",
    "summary": "Ve článku  \nEli Lilly v úterý oznámila, že její denní pilulka na hubnutí pomohla pacientům s obezitou a diabetem 2. typu zhubnout v pozdní fázi klinické studie, splnila hlavní cíl studie a otevřela cestu k podání žádosti o schválení léku na celosvětové úrovni. Tato léčba se přibližuje k tomu, aby se stala novou, bezjehlovou alternativou na vysoce lukrativním trhu s léky na hubnutí a diabetes, označovanými jako GLP-1. Pohodlnější pilulky by mohly zvýšit dostupnost těchto léčeb a usnadnit přístup k nim oproti drahým týdenním injekcím, které v současnosti na trhu dominují."
  },
  {
    "id": "2025-08-28T15:41:59.626Z-st4wh0",
    "title": "Lilly rounds out oral GLP-1 approval bid with phase 3 obesity win for patients with diabetes",
    "date": "2025-08-28T15:41:59.626Z",
    "sourceUrl": "https://www.fiercebiotech.com/biotech/lilly-rounds-out-oral-glp-1-approval-bid-ph-3-win-patients-obesity-and-diabetes",
    "sourceHost": "fiercebiotech.com",
    "mdUrl": "https://github.com/OnLi1971/mounjaro-summaries/blob/main/summaries/2025-08-28-ynto0z.md",
    "summary": "Po zveřejnění dat fáze 3 pro perorální GLP-1 přípravek orforglipron od Eli Lilly na začátku tohoto měsíce, farmaceutická společnost z Indianapolisu představila druhou polovinu datového balíčku, který podpoří šance léku na schválení pro léčbu obezity. V úterý Lilly oznámila, že všechny tři dávky orforglipronu pomohly v pozdní fázi studie Attain-2 splnit primární cíl i všechny klíčové sekundární cíle. Lék pomohl pacientům dosáhnout průměrné ztráty hmotnosti až 23 liber (přibližně 10,4 kg) a také snížení průměrné hladiny cukru v krvi a kardiometabolických rizikových faktorů po 72 týdnech studie."
  }
]